#define _CRT_SECURE_NO_WARNINGS 1;
#include<stdio.h>
#include<windows.h>
#include<stdlib.h>
#include<string.h>
#include<math.h>
/*
--------------------------------------------------------------------------------------------------

--------------------------------------------------------------------------------------------------
*/

/*--------------------------------分支语句之if语句-----------------------------------------*/
/*
--------------------------------------if中的条件判断---------------------------------------------
//C语言不能出现像0 <= age < 18这样的条件判断;
//这样输入的话只会判断0 <= age
int main()
{
	printf("请输入你的年龄:");
	int age;
	scanf("%d", &age);
	if (age >= 0 && age < 18)
	{
		printf("未成年...");
	}
	else if (age >= 18 && age < 35)
	{
		printf("壮年...");
	}
	else if (age >= 35 && age < 60)
	{
		printf("中年...");			
	}
	else
	{
		printf("老年...");
	}
}
--------------------------------------------------------------------------------------------------
*/

/*
---------------------------------------if - else 的关系------------------------------------------
默认地else会跟离它最近且没匹配的if进行匹配;
*/

/*
-----------------------------------关于 = 和 == 的小坑--------------------------------------------
int main()
{
	int num = 4;
	if (num = 5)
	{
		printf("俄乌战争会引发出一系列后果...");
	}

	//你以为不会输出东西,其实会输出;
	//这里的重点是:
	//     =   ---->  赋值
	//     ==  ---->  判断相等

	//为了避免这种看不出来的问题,可以这样写代码:
	if (5 == num)
	{
		printf("俄乌战争会引发出一系列后果...");
	}
	//这样写的好处是假如你写了5 = num,会报错;
	//变量赋值变量必须在左边;

	return 0;
}
--------------------------------------------------------------------------------------------------
*/

/*
---------------------------------------判断一个数是否是奇数----------------------------------------
int main()
{	
	int num;
	while (1)
	{
		printf("请输入一个数：");
		scanf("%d", &num);//假如输入不是数字的东西,会死循环;具体原因还是这个scanf函数;

		//判断这个数是不是奇数
		if (num >= 0)
		{
			if (num % 2 == 1)
			{
				printf("这个数是奇数\n");
			}
			else
			{
				printf("这个数是偶数\n");
			}
		}
		else
		{
			printf("你所输入的数不合规范,请再输入一次~~~\n");
		}
	}
	
	
}
--------------------------------------------------------------------------------------------------
*/

/*
--------------------------------------输出1-100的奇数-------------------------------------------
int main()
{
	//输出1-100的奇数
	int num = 0;
	while (num <= 100)
	{
		if (num % 2 == 1)
		{
			printf("%d\n", num);
		}
		num++;
	}
}
--------------------------------------------------------------------------------------------------
*/
 
/*
-------------------------------------分支语句之switch语句------------------------------------------
记住：switch语句没有break就不算分支语句;
	 switch语句还能嵌套使用;
int main()
{
	printf("请输入一个数字：\n");
	int num;
	scanf("%d", &num);
	switch (num)
	{
		//多个case一个结果不能这样写:
		//case 1,2,3,4,5,6:
		//printf("%d\n", num);

		//得这样写:
	case 1:
	case 2:
	case 3:
	case 4:
	case 5:
		printf("牛啊牛啊！\n");
		//switch语句能嵌套使用
		switch (num)
		{
		case 4:
			printf("不止牛了,直接飞天了好吧？\n");
		}
		break;
	default:
		printf("能不能别乱输?");
		break;
	}
}
-----------------------------------------switch语句的坑---------------------------------------
//坑点1:
//	switch语句没有break会继续往下走;
//坑点2：
//	嵌套的switch语句break只会结束嵌套的switch语句,外围switch语句不受影响;
int main()
{
	int n = 1;
	int m = 2;
	switch (n)
	{
	case 1:m++;
	case 2:n++;
	case 3:
		switch (n)
		{
		case 1:
			n++;
		case 2:
			m++;
			n++;
			break;
		}
	case 4:
		m++;
		break;
	default:
		break;
	}
	printf("m = %d,n = %d", m, n);
}
--------------------------------------------------------------------------------------------------
*/

/*
-------------------------------------循环语句--------------------------------------------------
/*
--------------------------------循环语句中continue和break----------------------------------------
//break:直接结束循环
int main()
{
	int num = 0;
	while (num <= 10)
	{
		if (num == 5)
		{
			break;
		}
		printf("%d\n", num);
		num++;
	}
}
--------------------------------------------------------------------------------------------------
//continue:结束后面的循环内容,直接回到循环开头继续下一个循环
//死循环
int main()
{
	int num = 0;
	while (num < 10)
	{
		if (num == 5)
		{
			printf("啊啊啊我卡住了！！！！\n");
			continue;
		}
		printf("%d\n", num);
		num++;
	}
}
--------------------------------------------------------------------------------------------------
//换一下num++的位置
int main()
{
	int num = 0;
	while (num < 10)
	{
		num++;
		if (num == 5)
		{
			printf("啊啊啊我卡住了！！！！\n");
			continue;
		}
		printf("%d\n", num);

	}
}
-------------------------------关于缓冲区的清空(getchar())-----------------------------------------
int main()
{
	int ret1 = 0;
	int ch = 0;
	char password[20] = { 0 };
	printf("请输入你的密码:>");
	//scanf("%s", password);
	//scanf函数会读取空格前的所有字符,遇到空格就会停止,如果输入密码123456 ABC,则ABC会在键盘缓冲区里不被读取到;
	//要想缓冲区内的字符清空,一般用getchar()
	//但是getchar()一次是不足以把所有字符都清空,这个函数一次只会清空一个字符;
	//getchar();

	//while ((ch = getchar()) != EOF)//EOF是ctrl+z，ASCII码值为-1
	//{
	//	putchar(ch);
	//
	//}

	while ((ch = getchar()) != '\n')
	{
		;
	}
	printf("请确认你的密码:(Y/N)", ret1);
	ret1 = getchar();
	if (ret1 == 'Y')
	{
		printf("确认成功！");
	}
	else
	{
		printf("确认失败！");
	}



}
--------------------------------------------------------------------------------------------------
int main()
{
	int ret = 0;
	while ((ret = getchar()) != EOF)
	{
		if (ret < '0' || ret > '9')
		{
			putchar(ret);
		}
		continue;
	}
}
------------------------------------------for循环-------------------------------------------------
int main()
{
	for (int i = 0; i < 10; i++)
	{
		printf("晚上还要上课\n");
	}
}
--------------------------------------------------------------------------------------------------
//判断部分如果被省略,判断条件恒为正;
int main()
{
	for (;;)
	{
		printf("沙雕唐斌!!!!!!\n");
	}
}
--------------------------------------------------------------------------------------------------
//但是省略不能乱省略
//问:会输出多少条语句?
int main()
{
	int i = 0;
	int j = 0;
	for (; i < 10; i++)
	{
		for (; j < 10; j++) {
			printf("肥仔有几个?\n%d个\n",j);
		}
	}
	//输出10条,不是100条,因为i的第一次循环完,j == 10,到第二个i的循环开始,传j值进去,这个j值还是10;
	//解决方法:把j=10补上;
}
--------------------------------------------------------------------------------------------------
//面试题
//问:会有几个循环进行?
int main()
{
	int a, b;
	for (a = 0, b = 0; b = 0; a++, b++)
	{
		printf(a);
	}
	//0个循环进行,因为for循环第二个条件判断为:b = 0 ----> 假,循环根本都没进去
}
--------------------------------------------------------------------------------------------------
试题1：求10的阶乘..妈的一直以为是5050,其实tm是3628800
int main()
{
	int m = 1;
	for (int i = 1; i <= 10; i++) {
		m = m * i;
		printf("%d\n", m);
	}
}
--------------------------------------------------------------------------------------------------
//试题2:求1！+2！+3！+......
int main()
{
	int m = 1;
	int sum = 0;
	for (int j = 1; j <= 10; j++)
	{
		for (int i = 1; i <= j; i++)
		{
			m = m * i;
		}
		sum = sum + m;

	}
	printf("%d", sum);//1444231215

}
--------------------------------------------------------------------------------------------------
试题3:在一个顺序数组中找到特定的数字
int main()
{
	printf("请输入你所要查询的数字：");
	int k = 22;
	//scanf("%d", &k)
	int i;
	int arr[20] = { 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20};
	//找几次能找到？有几个数就找几次
	int arr_size = sizeof(arr)/sizeof(arr[0]);
	for(i = 0;i < arr_size;i++)
	{
		if (k == arr[i])
		{
			printf("找到了,下标是%d", i);
			break;
		}

	}
	if (i == arr_size)
	{
		printf("找不到哦....");
	}


}
--------------------------------------------------------------------------------------------------
//试题3第二种解法:利用二分法查找
int main()
{
	int k = 6;
	//假设现在有个数组{1,2,3,4,5,6,7,8,9,10};
	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	//定义左右下标
	int right = sz - 1;
	int left = 0;
	int n = 1;
	while (left <= right)
	{
		int mid = (right + left) / 2;
		printf("第%d次的中心下标为%d\n", n++, mid);

		if (k < arr[mid])
		{
			right = mid - 1;
		}
		else if (k > arr[mid])
		{
			left = mid + 1;
		}
		else
		{
			printf("找到了,下标是%d", mid);
			break;
		}
	}
	if (left > right)
	{
		printf("很抱歉,找不到！");
	}
}
--------------------------------------------------------------------------------------------------
试题4:字符从两端向中间靠拢
int main()
{
	char arr1[] = "zefeng is a dasuohai,he comes from 309!";
	char arr2[] = "#######################################";
	int sz = sizeof(arr1) / sizeof(arr1[0]);
	printf("%d\n", sz);
	int left = 0;

	//int right = sz - 2;//为什么减2？
	//答:因为数组最后一个字符的下标是[数组长度 - 1],又因为数组默认最后一个字符为'\0'--->结束标志,所以减2;
	//也可以换一种写法:
	//strlen函数直接求出数组长度,'\0'不占长度,但是占一个字节;
	int right = strlen(arr1) - 1;


	//-----第一种写法
	int mid = (left + right) / 2;
	for (int i = 0; i < (mid + 1); i++)
	{
		arr2[left + i] = arr1[left + i];
		arr2[right - i] = arr1[right - i];
		printf("%s\n", arr2);
	}
	//

	//第二种写法
	while (left <= right)
	{
		//这样不行,两个++,会一次进行两次自加减
		//arr2[left++] = arr1[left++];
		//arr2[right--] = arr1[right--];

		arr2[left] = arr1[left];
		arr2[right] = arr1[right];
		system("cls");
		printf("%s\n", arr2);

		//下面这两条删了就不会有消失效果了
		arr2[left] = ' ';
		arr2[right] = ' ';

		Sleep(500);
		left++;
		right--;

	}
	system("cls");
	printf("你这个苏泽锋你很装逼啊！");
}
--------------------------------------------------------------------------------------------------
//试题5:密码登录
//重点:strcmp()函数
int main()
{
	char password[10] = "123456";
	int i;
	printf("请输入你的密码:");
	for (i = 0; i < 3; i++)
	{
		char input[10];
		scanf("%s", &input);
		if (strcmp(password,input) == 0)//strcmp()函数用来比较字符串,如果俩字符串一样,则返回0;
		{
			printf("验证成功,欢迎你！");
			break;
		}
		else
		{
			printf("验证失败\n");
			if (i < 2)
			{
				printf("请重新输入你的密码:");
			}
		}

	}
	if (i == 3)
	{
		printf("你输入的密码不正确！");
	}
}
--------------------------------------------------------------------------------------------------
//三个数从大到小输出
int main()
{
	int a;
	int b;
	int c;
	int temp;
	scanf("%d%d%d", &a, &b, &c);
	if (a < b)
	{
		temp = a;
		a = b;
		b = temp;
	}
	if (a < c)
	{
		temp = a;
		a = c;
		c = temp;
	}
	if (b < c)
	{
		temp = b;
		b = c;
		c = temp;
	}

	printf("%d %d %d", a, b, c);
}
--------------------------------------------------------------------------------------------------
//求两个数的最大公约数
//用到"辗转相除法"
//就比如:  24  和   18 的最大公约数
//  1.先用24模18,得 6
//  2.把18赋给24，再把6赋给18
//  3.再用18模6,得0
//  4.就能得出:6是24和18的最大公约数
int main()
{
	int a = 0;
	int b = 0;
	int temp = 0;
	printf("请输入两个数(请按从大到小顺序输入):");
	scanf("%d%d", &a, &b);
	while (1)
	{
		if (a == 0 || b == 0)
		{
			printf("输入的数不合规范");
			break;
		}
		if (a % b == 0)
		{
			printf("最大公约数是%d", b);
			break;
		}
			temp = a % b;
			a = b;
			b = temp;
	}

}
--------------------------------------------------------------------------------------------------
//求两个数的最大公约数：多了个排序
int main()
{
	int a = 0;
	int b = 0;
	int temp1 = 0;
	int temp2 = 0;
	scanf("%d%d", &a, &b);
	if (a < b)
	{
		temp1 = a;
		a = b;
		b = temp1;
	}
	while (1)
	{


		if(a == 0||b ==0)
		{
			printf("你输入的数不合规范");
			break;
		}

		if (a % b == 0)
		{
			printf("最大公因数是:%d", b);
			break;
		}

		temp2 = a % b;
		a = b;
		b = temp2;
	}
}
--------------------------------------------------------------------------------------------------
//求1000年-2000年所有的闰年
//满足闰年要啥要求:
//       1.能被4整除而且不能被100整除
//		 2.能被400整除
//		以上俩要求能满足一个就行了;
--------------------------------------------------------------------------------------------------
//######求素数的n种境界(在资料袋里面)
//现在先来一种简单的
//求100-200之间的素数
int main()
{
	//用试除法
	//求每个数是否是素数:只要满足这个数能否被 小于等于这个数的开方 整除,这个数就不是素数;否则就是素数;

	printf("%f\n", sqrt(101));
	int first = 100;
	int last = 200;
	int i = 0;
	int j = 0;
	int count = 0;
	for (i = first; i <= last; i++)
	{
		//一个一个素数进来进行整除
		for (j = 2; j <= sqrt(i); j++)
		{
			if (i % j == 0)
			{
				break;
			}

		}
		if (j > sqrt(i))
		{
			printf("这个数是素数:%d\n", i);
			count++;

		}
		//为什么j可以>sqrt(i)?因为j++,最后一次j=10的时候满足10<=sqrt(101)也就是10.049876,所以j还能进去,
		//进去之后再j++,++完了发现不满足10<=sqrt(101)了,所以跳出了循环,此时j为11;
	}
	printf("素数的个数是:%d\n", count);
	return 0;
 }
--------------------------------------------------------------------------------------------------
//求出1-100间出现9的次数
int main()
{
	int i = 0;
	int count = 0;
	for (i = 1; i <= 100; i++)
	{
		//个位是9
		if (i % 10 == 9)
		{
			printf("%d\n", i);
			count++;
		}
		//十位是9
		if (i / 10 == 9)
		{
			printf("%d\n", i);
			count++;
		}
		//两个if一定要并列,不能else if,因为有99;
	}
	printf("出现9的次数是:%d\n", count);
}
--------------------------------------------------------------------------------------------------
//求1/1-1/2+1/3-1/4+1/5-...+1/99-1/100的值;
//小小的题目有很多知识点:
//1. 1/整数除出来是整数,不会给你小数,必须让分子或分母有一个是小数;
//2. 
//第一种做法
int main()
{
	int i = 1;
	int j = 2;
	double sum1 = 0;
	double sum2 = 0;
	for (i = 1; i <= 99; i += 2)
	{
		sum1 = sum1 + 1.0 / i;
	}
	for (j = 2; j <= 100; j += 2)
	{
		sum2 = sum2 + 1.0 / j;
	}
	printf("值为:%fl\n", (sum1 - sum2));
}
--------------------------------------------------------------------------------------------------
第二种方法:(更好),以后正负交替计算的都考虑上flag = -flag;
int main()
{
	int i = 1;
	double sum = 0;
	int flag = 1;
	for (i = 1; i <= 100; i++)
	{
		sum = sum + flag * (1.0 / i);
		flag = -flag;
	}
	printf("%fl\n", sum);
}
--------------------------------------------------------------------------------------------------
//求出10个数之中的最大值
int main()
{
	int i = 0;
	int max1 = 0;
	int max2 = 0;
	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };
	for (i = 0; i < 10; i++)
	{
		if (arr1[i] > max1)
		{
			max1 = arr1[i];
		}
	}
	printf("arr1最大值是:%d\n", max1);//10

	//但是这里有个问题,假如数组里面存的是负数呢?
	int arr2[10] = { -1,-2,-3,-4,-5,-6,-7,-8,-9,-10 };
	for (i = 0; i < 10; i++)
	{
		if (arr2[i] > max2)
		{
			max2 = arr2[i];
		}
	}
	printf("arr2最大值是:%d\n", max2);//0
	//为什么呢？因为max2是0,0跟他们比较,0一直是最大的;
	//要找出一个更好的max值

	//给max值设为数组里的数就行了,把max设为arr[0]
	int arr3[10] = { -1,-2,-3,-4,-5,-6,-7,-8,-9,-10 };
	int max3 = arr3[0];
	for (i = 0; i < 10; i++)
	{
		if (arr3[i] > max3)
		{
			max3 = arr3[i];
		}
	}
	printf("arr2最大值是:%d\n", max3);//-1

}
--------------------------------------------------------------------------------------------------
int main()
{
	int i = 1;
	int j = 1;
	//打印99乘法口诀表
	for (i = 1; i < 10; i++)
	{
		for (j = 1; j <= i; j++)
		{
			printf("%d * %d = %d ", i, j, (i * j));
		}

		printf("\n");
	}
}
--------------------------------------------------------------------------------------------------
//猜数字游戏
void game()
{
	//srand(1);

	while (1)
	{
		srand((unsigned)time(NULL));
		//如果不加这个函数,ret每次开始随机都是以特定的顺序出现随机数,看似随机其实不是;
		//但是这个函数参数得传个随机数,不过我们一开始要用srand函数来让ret能输出随机数,
		//而这的前提是srand参数传进一个随机数,这不矛盾了吗？
		//所以我们要传进去一个时刻变化的值:时间戳
		int ret = (rand() % 100) + 1;
		printf("############################");
		printf("###选1开始游戏 选0退出游戏###");
		printf("############################");
		printf("\n请输入>:");
		int input = 0;
		scanf("%d", &input);
		switch (input)
		{
		case 1:
			printf("随机数已生成,请输入你想要猜的数字:\n");
			//printf("随机数是%d\n", ret);
			while (1)
			{
				int guess = 0;
				scanf("%d", &guess);
				if (ret > guess)
				{
					printf("小了\n");
				}
				else if (ret < guess)
				{
					printf("大了\n");
				}
				else
				{
					printf("恭喜你！找到了,数字是:%d\n", guess);
					break;
				}
			}
			break;
		case 0:
			break;
		default:
			printf("你输入格式不对,请重新输入:\n");
		}
		if (input == 0)
		{
			break;
		}


	}

}
int main()
{
	game();
}
--------------------------------------------------------------------------------------------------
------------------------------------do....while循环-----------------------------------------------
----------------------------------------goto语句--------------------------------------------------
*/

